-- 브랜드 데이터 삽입
INSERT INTO brand (name) VALUES 
('A'), ('B'), ('C'), ('D'), ('E'), ('F'), ('G'), ('H'), ('I');

-- 상품 데이터 삽입 (브랜드 A)
INSERT INTO product (category, name, price, brand_id) VALUES 
('상의', 'A 상의', 11200, 1),
('아우터', 'A 아우터', 5500, 1),
('바지', 'A 바지', 4200, 1),
('스니커즈', 'A 스니커즈', 9000, 1),
('가방', 'A 가방', 2000, 1),
('모자', 'A 모자', 1700, 1),
('양말', 'A 양말', 1800, 1),
('액세서리', 'A 액세서리', 2300, 1);

-- 상품 데이터 삽입 (브랜드 B)
INSERT INTO product (category, name, price, brand_id) VALUES 
('상의', 'B 상의', 10500, 2),
('아우터', 'B 아우터', 5900, 2),
('바지', 'B 바지', 3800, 2),
('스니커즈', 'B 스니커즈', 9100, 2),
('가방', 'B 가방', 2100, 2),
('모자', 'B 모자', 2000, 2),
('양말', 'B 양말', 2000, 2),
('액세서리', 'B 액세서리', 2200, 2);

-- 상품 데이터 삽입 (브랜드 C)
INSERT INTO product (category, name, price, brand_id) VALUES 
('상의', 'C 상의', 10000, 3),
('아우터', 'C 아우터', 6200, 3),
('바지', 'C 바지', 3300, 3),
('스니커즈', 'C 스니커즈', 9200, 3),
('가방', 'C 가방', 2200, 3),
('모자', 'C 모자', 1900, 3),
('양말', 'C 양말', 2200, 3),
('액세서리', 'C 액세서리', 2100, 3);

-- 상품 데이터 삽입 (브랜드 D)
INSERT INTO product (category, name, price, brand_id) VALUES 
('상의', 'D 상의', 10100, 4),
('아우터', 'D 아우터', 5100, 4),
('바지', 'D 바지', 3000, 4),
('스니커즈', 'D 스니커즈', 9500, 4),
('가방', 'D 가방', 2500, 4),
('모자', 'D 모자', 1500, 4),
('양말', 'D 양말', 2400, 4),
('액세서리', 'D 액세서리', 2000, 4);

-- 상품 데이터 삽입 (브랜드 E)
INSERT INTO product (category, name, price, brand_id) VALUES 
('상의', 'E 상의', 10700, 5),
('아우터', 'E 아우터', 5000, 5),
('바지', 'E 바지', 3800, 5),
('스니커즈', 'E 스니커즈', 9900, 5),
('가방', 'E 가방', 2300, 5),
('모자', 'E 모자', 1800, 5),
('양말', 'E 양말', 2100, 5),
('액세서리', 'E 액세서리', 2100, 5);

-- 상품 데이터 삽입 (브랜드 F)
INSERT INTO product (category, name, price, brand_id) VALUES 
('상의', 'F 상의', 11200, 6),
('아우터', 'F 아우터', 7200, 6),
('바지', 'F 바지', 4000, 6),
('스니커즈', 'F 스니커즈', 9300, 6),
('가방', 'F 가방', 2100, 6),
('모자', 'F 모자', 1600, 6),
('양말', 'F 양말', 2300, 6),
('액세서리', 'F 액세서리', 1900, 6);

-- 상품 데이터 삽입 (브랜드 G)
INSERT INTO product (category, name, price, brand_id) VALUES 
('상의', 'G 상의', 10500, 7),
('아우터', 'G 아우터', 5800, 7),
('바지', 'G 바지', 3900, 7),
('스니커즈', 'G 스니커즈', 9000, 7),
('가방', 'G 가방', 2200, 7),
('모자', 'G 모자', 1700, 7),
('양말', 'G 양말', 2100, 7),
('액세서리', 'G 액세서리', 2000, 7);

-- 상품 데이터 삽입 (브랜드 H)
INSERT INTO product (category, name, price, brand_id) VALUES 
('상의', 'H 상의', 10800, 8),
('아우터', 'H 아우터', 6300, 8),
('바지', 'H 바지', 3100, 8),
('스니커즈', 'H 스니커즈', 9700, 8),
('가방', 'H 가방', 2100, 8),
('모자', 'H 모자', 1600, 8),
('양말', 'H 양말', 2000, 8),
('액세서리', 'H 액세서리', 2000, 8);

-- 상품 데이터 삽입 (브랜드 I)
INSERT INTO product (category, name, price, brand_id) VALUES 
('상의', 'I 상의', 11400, 9),
('아우터', 'I 아우터', 6700, 9),
('바지', 'I 바지', 3200, 9),
('스니커즈', 'I 스니커즈', 9500, 9),
('가방', 'I 가방', 2400, 9),
('모자', 'I 모자', 1700, 9),
('양말', 'I 양말', 1700, 9),
('액세서리', 'I 액세서리', 2400, 9); 